const log = [
  {
    version: '1.0.9',
    time: '2020-08-07',
    content: [
      '新增帮助文档。',
      '优化平台体验。',
      '优化class命名，添加 vf- 前缀。',
    ]
  },
  {
    version: '1.0.8',
    time: '2020-08-06',
    content: [
      '修复颜色选择器组件选择后功能无法使用问题。',
      '优化首页，添加导航。',
      '优化首页，添加更新日志。',
      '优化首页，添加源码查看。',
      '优化分割线组件功能，支持配置是否是虚线。',
      '优化分割线组件功能，隐藏不可修改属性。',
      '修复穿梭框组件样式，部分样式与其他样式覆盖，显示异常。',
    ]
  },
  {
    version: '1.0.7',
    time: '2020-07-27',
    content: [
      '修复单项选择组件禁用功能无法使用问题。',
      '优化日期选择组件功能，支持配置是否可以清除值。',
      '优化日期范围组件功能，支持配置是否可以清除值。',
      '优化下拉选择组件功能，支持配置是否可以清除值。',
      '优化星级评分组件功能，支持配置是否可以清除值。',
      '优化UI，添加使用iView-UI。',
    ]
  },
  {
    version: '1.0.6',
    time: '2020-07-20',
    content: [
      '优化多项选择控件组件功能，支持控制其他组件，级联效果。',
      '优化下拉选择控件组件功能，支持控制其他组件，级联效果。',
      '优化单项选择控件组件功能，支持控制其他组件，级联效果。',
    ]
  },
  {
    version: '1.0.5',
    time: '2020-07-14',
    content: [
      '优化多项选择控件组件功能，支持动态获取列表。',
      '优化下拉选择控件组件功能，支持动态获取列表。',
      '优化单项选择控件组件功能，支持动态获取列表。',
    ]
  },
  {
    version: '1.0.4',
    time: '2020-07-10',
    content: [
      '优化组件排序功能。',
      '新增修饰组件 分割线组件。',
    ]
  },
  {
    version: '1.0.3',
    time: '2020-07-02',
    content: [
      '新增星级评分控件组件 f-color-picker。',
    ]
  },
  {
    version: '1.0.2',
    time: '2020-06-27',
    content: [
      '新增星级评分控件组件 f-date-rate。',
      '新增滑块控件组件 f-date-slider。',
    ]
  },
  {
    version: '1.0.1',
    time: '2020-06-25',
    content: [
      '新增日期范围控件组件 f-date-range。',
      '新增日期选择控件组件 f-date-picker。',
    ]
  },
  {
    version: '1.0.0',
    time: '2020-06-20',
    content: [
      '新增单行文本控件组件 f-input。',
      '新增多行文本控件组件 f-textarea。',
      '新增开关控件组件 f-switch。',
      '新增单项选择控件组件 f-radio。',
      '新增下拉选择控件组件 f-select。',
      '新增多项选择控件组件 f-multiple。',
    ]
  }
];
export default log
